docs/posts/2023-12-31-converting-org-files-to-canvas-quizzes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Jan 08, 2025 05:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Converting Org Files to Canvas Quizzes</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Converting Org Files to Canvas Quizzes
<br />
<span class="subtitle">May 24, 2024 00:00</span>
</h1>
<p>
Oklahoma Baptist University, like many others, uses <a href="https://www.instructure.com">Canvas</a> for a Learning Management System. There are many things I like about Canvas, but creating quizzes is not one of them. It is very difficult to do without constantly using the mouse, something that I find irritating and inefficient.
</p>

<p>
Before we used Canvas, we used <a href="https://moodle.org">Moodle</a>. One of the features that I really liked about Moodle was the ability to write tests in a simple format (<a href="https://docs.moodle.org/403/en/GIFT_format">GIFT</a>) using a text editor that could be imported into the LMS. Canvas, on the other hand, can import QTI files, which can be created with a text editor, but, unfortunately, QTI is not a simple format. QTI files are fairly complex XML files. One of my projects this January was to write something to convert a simple text file to the QTI format needed for Canvas. Since I use Emacs, Org mode is the natural file type to use. The more that I looked into the QTI format, the more I realized that this is a project best left to the summer, not the short time between the Fall and Spring semesters. Still, my research revealed some other options:
</p>

<ul class="org-ul">
<li>Geoffrey Poore&rsquo;s <a href="https://github.com/gpoore/text2qti">text2qti</a> converts Markdown files into QTI format quizzes. This would probably be the smart thing to use. I&rsquo;ll experiment with it over the next few weeks.</li>
<li>The <a href="https://canconvert.k-state.edu/qti/">Classic to Canvas Converter</a> provided by Kansas State. This inputs a CSV file created with a spreadsheet, and outputs a QTI file that can imported into Canvas. It works well, using <a href="https://dl.sps.northwestern.edu/canvas/2021/06/add-quiz-questions-to-canvas-by-converting-csv-files-to-qti-zip-files/">these instructions</a> provided by the Northwestern University School of Professional Studies.</li>
<li>The <a href="https://www.nyit.edu/its/canvas_exam_converter">Canvas Exam Converter</a> provided by the New York Institute of Technology. This has a text field in which can be pasted simply formatted text for the following question types: multiple choice, multiple answers, short answer, essay, and file upload. The tool checks for syntax errors, then converts the text to a QTI file and automatically downloads it.</li>
</ul>

<p>
In the end, I&rsquo;ll probably use text2qti, but for now, I&rsquo;ve opted for the Canvas Exam Converter. I mostly use multiple choice and essay questions on my Canvas quizzes, but have occasionally also used multiple answer questions. So. the Canvas Exam Converter is more than enough for my needs. Here is an example using each of the five question types that the converter allows: 
</p>

<pre class="example" id="orgf50a213">
1. Multiple choice question (single correct answer)
a) Wrong
b) Wrong
*c) Right
d) Wrong

2. Multiple choice question (several correct answers)
[*] Right
[ ] Wrong
[*] Right
[ ] Wrong

3. Short answer question
* Acceptable answer
* Another acceptable answer

4. Essay question
####

5. File upload question
^^^^
</pre>


<p>
Now, this would be very simple to just type from scratch. Note that it is just a list with different styles of bullets for different kinds of questions, and Org mode is a very good tool for quickly creating lists. Org mode offers different options for the list indicators, and for each list type that converter requires, there is something very close to it in Org mode. To cycle through all of the options, put the point on a list item and enter <code>C-c &lt;right&gt;</code>. So, here&rsquo;s the Org text that I decided to use:
</p>

<pre class="example" id="orgc156e68">
1. Multiple choice question (single correct answer)
   a) Wrong
   b) Wrong
   c) Right*
   d) Wrong
2. Multiple answer question (several correct answers)
   - [X] Right
   - [ ] Wrong
   - [X] Right
   - [ ] Wrong
3. Short answer question
   + Acceptable answer
   + Another acceptable answer
4. Essay question
   - ####
5. File upload question
   - ^^^^
</pre>

<p>
The first thing to do is to allow letters for numbered lists in Org mode.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>  This is done by adding this to the init file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-list-allow-alphabetical t)
</pre>
</div>

<p>
Note that the correct answer to a multiple choice question is marked with an asterisk at the end of the option. Now, I just needed to do a few things, each accomplished easily with a regex search and replace:
</p>

<ol class="org-ol">
<li>Remove the hyphens.</li>
<li>Move the asterisk from the end of the correct multiple choice answer to the before the list item letter.</li>
<li>Change each short answer &ldquo;+&rdquo; bullet to an asterisk.</li>
<li>Change the multiple answer correct answer indicator to an asterisk.</li>
<li>Remove the whitespace from the beginning of each line</li>
<li>Add a blank line between each question.</li>
</ol>

<p>
I&rsquo;m sure that the third and fourth steps can be combined. For various reasons the converter didn&rsquo;t like the blank lines at the beginning and the end, so I added a couple of steps to delete those. Initially, I had all of these replacements done on the text in the original buffer, requiring me to undo everything if I wanted to add something to the quiz. So, I decided it would be best to copy the Org text to a temp buffer, perform the replacements in the temp buffer, and copy the result to the clipboard ready to paste into the converter. To make things even easier, I have the function open the converter page in my default browser. In the end, the conversion function looks like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span class="org-keyword">defun</span> <span class="org-function-name">convert-qti-nyit</span> ()
    (<span class="org-keyword">interactive</span>)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Copy all to a temp buffer and set to text mode.</span>
    (<span class="org-keyword">let</span> ((old-buffer (current-buffer)))
      (<span class="org-keyword">with-temp-buffer</span>
        (insert-buffer-substring old-buffer)
        (text-mode)
        <span class="org-comment-delimiter">;; </span><span class="org-comment">convert multiple correct answer and essay questions</span>
        (beginning-of-buffer)
        (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"-"</span> nil t)
          (replace-match <span class="org-string">""</span>))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Change correct multiple answer options to "*"</span>
        (beginning-of-buffer)
(<span class="org-keyword">let</span> ((case-fold-search nil))
        (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">[X</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">]"</span> nil t)
          (replace-match <span class="org-string">"*"</span>)))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Mark short answer responses with "**"</span>
        (beginning-of-buffer)
        (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"+"</span> nil t)
          (replace-match <span class="org-string">"*"</span>))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">remove whitespace at beginning of lines</span>
        (beginning-of-buffer)
        (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"^\s-*"</span> nil t)
          (replace-match <span class="org-string">""</span>))
        (beginning-of-buffer)
        (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[0-9]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> nil t)
          (replace-match <span class="org-string">"\n\\1"</span>))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">move correct answer symbol to beginning of line</span>
        (beginning-of-buffer)
        (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">^.*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*$</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> nil t)
          (replace-match <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">*\\1"</span>))
        (delete-trailing-whitespace)
        <span class="org-comment-delimiter">;; </span><span class="org-comment">delete empty line at end and beginning</span>
        (end-of-buffer)
        (delete-char -1)
        (beginning-of-buffer)
        (kill-line)
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Copy result to clipboard</span>
        (clipboard-kill-ring-save (point-min) (point-max))
        )
      )
    (browse-url <span class="org-string">"https://www.nyit.edu/its/canvas_exam_converter"</span>)
    )
</pre>
</div>

<p>
The file generated by the converter has to be compressed to a zip file before uploading the Canvas. In Mac OS, that&rsquo;s done with a right-click on the file in the Finder and choosing the compress option. An advantage to using text2qti is that the conversion and compression could be automated using a shell script. Maybe that will be tomorrow&rsquo;s project.
</p>

<div class="tagline" id="org5c12138">
<p>
Tagged:  <a href="../tags/teaching.html">Teaching</a> <a href="../tags/org.html">Org</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I didn&rsquo;t realize this was possible at first. I initially used a numbered list for the multiple choice answers, then did five separate regex replaces, changing &ldquo;1)&rdquo; to &ldquo;a)&rdquo; and so on through &ldquo;5)&rdquo; to &ldquo;e)&rdquo;, and just resigned myself to adding any other options in Canvas itself. Changing the value of <code>setq org-list-allow-alphabetical</code> to <code>t</code> simplifies the conversion function and allows for an arbitrary number of answer options.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 08, 2025 05:11.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
